snech99/Cube_Solver_Robot/src/Mikrocontroller/Cube_Project/board/pin_mux.h
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

#define PCR_IBE_ibe1 0x01u /*!<@brief Input Buffer Enable: Enables */
#define PCR_PE_pe1 0x01u   /*!<@brief Pull Enable: Enables */
#define PCR_PS_ps1 0x01u   /*!<@brief Pull Select: Enables internal pullup resistor */

/*! @name PORT1_4 (number 62), UART_RX
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITCOM_UART_RX_PORT PORT1               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITCOM_UART_RX_PIN 4U                   /*!<@brief PORT pin number */
#define BOARD_INITCOM_UART_RX_PIN_MASK (1U << 4U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*! @name PORT1_5 (number 63), UART_TX
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITCOM_UART_TX_PORT PORT1               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITCOM_UART_TX_PIN 5U                   /*!<@brief PORT pin number */
#define BOARD_INITCOM_UART_TX_PIN_MASK (1U << 5U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*! @name PORT1_9 (number 3), I2C_SCL
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITCOM_I2C_SCL_PORT PORT1               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITCOM_I2C_SCL_PIN 9U                   /*!<@brief PORT pin number */
#define BOARD_INITCOM_I2C_SCL_PIN_MASK (1U << 9U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*! @name PORT1_8 (number 2), I2C_SDA
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITCOM_I2C_SDA_PORT PORT1               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITCOM_I2C_SDA_PIN 8U                   /*!<@brief PORT pin number */
#define BOARD_INITCOM_I2C_SDA_PIN_MASK (1U << 8U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitCOM(void);

/*! @name PORT3_12 (number 38), LED_RED
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITLED_LED_RED_GPIO GPIO3                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITLED_LED_RED_GPIO_PIN 12U              /*!<@brief GPIO pin number */
#define BOARD_INITLED_LED_RED_GPIO_PIN_MASK (1U << 12U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITLED_LED_RED_PORT PORT3                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITLED_LED_RED_PIN 12U                   /*!<@brief PORT pin number */
#define BOARD_INITLED_LED_RED_PIN_MASK (1U << 12U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PORT3_13 (number 37), LED_GREEN
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITLED_LED_GREEN_GPIO GPIO3                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITLED_LED_GREEN_GPIO_PIN 13U              /*!<@brief GPIO pin number */
#define BOARD_INITLED_LED_GREEN_GPIO_PIN_MASK (1U << 13U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITLED_LED_GREEN_PORT PORT3                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITLED_LED_GREEN_PIN 13U                   /*!<@brief PORT pin number */
#define BOARD_INITLED_LED_GREEN_PIN_MASK (1U << 13U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name PORT3_0 (number 46), PWM
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITLED_LED_BLUE_GPIO GPIO3               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITLED_LED_BLUE_GPIO_PIN 0U              /*!<@brief GPIO pin number */
#define BOARD_INITLED_LED_BLUE_GPIO_PIN_MASK (1U << 0U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITLED_LED_BLUE_PORT PORT3               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITLED_LED_BLUE_PIN 0U                   /*!<@brief PORT pin number */
#define BOARD_INITLED_LED_BLUE_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitLED(void);

#define PCR_IBE_ibe1 0x01u          /*!<@brief Input Buffer Enable: Enables */
#define PCR_PE_pe1 0x01u            /*!<@brief Pull Enable: Enables */
#define PCR_PS_ps1 0x01u            /*!<@brief Pull Select: Enables internal pullup resistor */
#define PORT2_PCR13_MUX_mux00 0x00u /*!<@brief Pin Multiplex Control: Alternative 0 (GPIO) */
#define PORT2_PCR16_MUX_mux00 0x00u /*!<@brief Pin Multiplex Control: Alternative 0 (GPIO) */
#define PORT2_PCR1_MUX_mux00 0x00u  /*!<@brief Pin Multiplex Control: Alternative 0 (GPIO) */
#define PORT2_PCR2_MUX_mux00 0x00u  /*!<@brief Pin Multiplex Control: Alternative 0 (GPIO) */
#define PORT2_PCR6_MUX_mux00 0x00u  /*!<@brief Pin Multiplex Control: Alternative 0 (GPIO) */

/*! @name PORT1_7 (number 1), SW_3
  @{ */

