snech99/Cube_Solver_Robot/src/Mikrocontroller/Cube_Project/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITSW_SW_3_GPIO GPIO1               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITSW_SW_3_GPIO_PIN 7U              /*!<@brief GPIO pin number */
#define BOARD_INITSW_SW_3_GPIO_PIN_MASK (1U << 7U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITSW_SW_3_PORT PORT1               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITSW_SW_3_PIN 7U                   /*!<@brief PORT pin number */
#define BOARD_INITSW_SW_3_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                                   /* @} */

/*! @name PORT2_6 (number 20), TASTER_T_L
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITSW_TASTER_T_L_GPIO GPIO2               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITSW_TASTER_T_L_GPIO_PIN 6U              /*!<@brief GPIO pin number */
#define BOARD_INITSW_TASTER_T_L_GPIO_PIN_MASK (1U << 6U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITSW_TASTER_T_L_PORT PORT2               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITSW_TASTER_T_L_PIN 6U                   /*!<@brief PORT pin number */
#define BOARD_INITSW_TASTER_T_L_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PORT2_13 (number 23), TASTER_B_L
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITSW_TASTER_B_L_GPIO GPIO2                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITSW_TASTER_B_L_GPIO_PIN 13U              /*!<@brief GPIO pin number */
#define BOARD_INITSW_TASTER_B_L_GPIO_PIN_MASK (1U << 13U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITSW_TASTER_B_L_PORT PORT2                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITSW_TASTER_B_L_PIN 13U                   /*!<@brief PORT pin number */
#define BOARD_INITSW_TASTER_B_L_PIN_MASK (1U << 13U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name PORT2_2 (number 16), TASTER_B_R
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITSW_TASTER_B_R_GPIO GPIO2               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITSW_TASTER_B_R_GPIO_PIN 2U              /*!<@brief GPIO pin number */
#define BOARD_INITSW_TASTER_B_R_GPIO_PIN_MASK (1U << 2U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITSW_TASTER_B_R_PORT PORT2               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITSW_TASTER_B_R_PIN 2U                   /*!<@brief PORT pin number */
#define BOARD_INITSW_TASTER_B_R_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PORT2_16 (number 24), TASTER_T_R
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITSW_TASTER_T_R_GPIO GPIO2                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITSW_TASTER_T_R_GPIO_PIN 16U              /*!<@brief GPIO pin number */
#define BOARD_INITSW_TASTER_T_R_GPIO_PIN_MASK (1U << 16U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITSW_TASTER_T_R_PORT PORT2                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITSW_TASTER_T_R_PIN 16U                   /*!<@brief PORT pin number */
#define BOARD_INITSW_TASTER_T_R_PIN_MASK (1U << 16U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name PORT2_1 (number 15), LED_SWITCH
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITSW_LED_SWITCH_GPIO GPIO2               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITSW_LED_SWITCH_GPIO_PIN 1U              /*!<@brief GPIO pin number */
#define BOARD_INITSW_LED_SWITCH_GPIO_PIN_MASK (1U << 1U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITSW_LED_SWITCH_PORT PORT2               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITSW_LED_SWITCH_PIN 1U                   /*!<@brief PORT pin number */
#define BOARD_INITSW_LED_SWITCH_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PORT1_6 (number 64), INTERUPT_SENSOR
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITSW_INTERUPT_SENSOR_GPIO GPIO1               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITSW_INTERUPT_SENSOR_GPIO_PIN 6U              /*!<@brief GPIO pin number */
#define BOARD_INITSW_INTERUPT_SENSOR_GPIO_PIN_MASK (1U << 6U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITSW_INTERUPT_SENSOR_PORT PORT1               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITSW_INTERUPT_SENSOR_PIN 6U                   /*!<@brief PORT pin number */
#define BOARD_INITSW_INTERUPT_SENSOR_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                                              /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitSW(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitCLOCK(void);

/*! @name PORT3_30 (number 31), DIR_blue
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPWM_DIR_blue_GPIO GPIO3                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPWM_DIR_blue_GPIO_PIN 30U              /*!<@brief GPIO pin number */
#define BOARD_INITPWM_DIR_blue_GPIO_PIN_MASK (1U << 30U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPWM_DIR_blue_PORT PORT3                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPWM_DIR_blue_PIN 30U                   /*!<@brief PORT pin number */
#define BOARD_INITPWM_DIR_blue_PIN_MASK (1U << 30U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PORT2_0 (number 14), DIR_green
  @{ */

