snech99/Cube_Solver_Robot/src/Mikrocontroller/Cube_Project/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITPWM_DIR_green_GPIO GPIO2               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPWM_DIR_green_GPIO_PIN 0U              /*!<@brief GPIO pin number */
#define BOARD_INITPWM_DIR_green_GPIO_PIN_MASK (1U << 0U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPWM_DIR_green_PORT PORT2               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPWM_DIR_green_PIN 0U                   /*!<@brief PORT pin number */
#define BOARD_INITPWM_DIR_green_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PORT1_13 (number 7), DIR_yellow
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPWM_DIR_yellow_GPIO GPIO1                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPWM_DIR_yellow_GPIO_PIN 13U              /*!<@brief GPIO pin number */
#define BOARD_INITPWM_DIR_yellow_GPIO_PIN_MASK (1U << 13U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPWM_DIR_yellow_PORT PORT1                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPWM_DIR_yellow_PIN 13U                   /*!<@brief PORT pin number */
#define BOARD_INITPWM_DIR_yellow_PIN_MASK (1U << 13U)      /*!<@brief PORT pin mask */
                                                           /* @} */

/*! @name PORT1_12 (number 6), DIR_white
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPWM_DIR_white_GPIO GPIO1                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPWM_DIR_white_GPIO_PIN 12U              /*!<@brief GPIO pin number */
#define BOARD_INITPWM_DIR_white_GPIO_PIN_MASK (1U << 12U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPWM_DIR_white_PORT PORT1                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPWM_DIR_white_PIN 12U                   /*!<@brief PORT pin number */
#define BOARD_INITPWM_DIR_white_PIN_MASK (1U << 12U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name PORT3_1 (number 45), EN_GREEN
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPWM_EN_GREEN_GPIO GPIO3               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPWM_EN_GREEN_GPIO_PIN 1U              /*!<@brief GPIO pin number */
#define BOARD_INITPWM_EN_GREEN_GPIO_PIN_MASK (1U << 1U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPWM_EN_GREEN_PORT PORT3               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPWM_EN_GREEN_PIN 1U                   /*!<@brief PORT pin number */
#define BOARD_INITPWM_EN_GREEN_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PORT2_5 (number 19), EN_RED
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPWM_EN_RED_GPIO GPIO2               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPWM_EN_RED_GPIO_PIN 5U              /*!<@brief GPIO pin number */
#define BOARD_INITPWM_EN_RED_GPIO_PIN_MASK (1U << 5U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPWM_EN_RED_PORT PORT2               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPWM_EN_RED_PIN 5U                   /*!<@brief PORT pin number */
#define BOARD_INITPWM_EN_RED_PIN_MASK (1U << 5U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PORT2_4 (number 18), EN_YELLOW
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPWM_EN_YELLOW_GPIO GPIO2               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPWM_EN_YELLOW_GPIO_PIN 4U              /*!<@brief GPIO pin number */
#define BOARD_INITPWM_EN_YELLOW_GPIO_PIN_MASK (1U << 4U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPWM_EN_YELLOW_PORT PORT2               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPWM_EN_YELLOW_PIN 4U                   /*!<@brief PORT pin number */
#define BOARD_INITPWM_EN_YELLOW_PIN_MASK (1U << 4U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PORT3_14 (number 36), EN_BLUE
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPWM_EN_BLUE_GPIO GPIO3                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPWM_EN_BLUE_GPIO_PIN 14U              /*!<@brief GPIO pin number */
#define BOARD_INITPWM_EN_BLUE_GPIO_PIN_MASK (1U << 14U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPWM_EN_BLUE_PORT PORT3                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPWM_EN_BLUE_PIN 14U                   /*!<@brief PORT pin number */
#define BOARD_INITPWM_EN_BLUE_PIN_MASK (1U << 14U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PORT3_15 (number 35), EN_ORANGE
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPWM_EN_ORANGE_GPIO GPIO3                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPWM_EN_ORANGE_GPIO_PIN 15U              /*!<@brief GPIO pin number */
#define BOARD_INITPWM_EN_ORANGE_GPIO_PIN_MASK (1U << 15U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPWM_EN_ORANGE_PORT PORT3                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPWM_EN_ORANGE_PIN 15U                   /*!<@brief PORT pin number */
#define BOARD_INITPWM_EN_ORANGE_PIN_MASK (1U << 15U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name PORT2_3 (number 17), EN_WHITE
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPWM_EN_WHITE_GPIO GPIO2               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPWM_EN_WHITE_GPIO_PIN 3U              /*!<@brief GPIO pin number */
#define BOARD_INITPWM_EN_WHITE_GPIO_PIN_MASK (1U << 3U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPWM_EN_WHITE_PORT PORT2               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPWM_EN_WHITE_PIN 3U                   /*!<@brief PORT pin number */
#define BOARD_INITPWM_EN_WHITE_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PORT3_8 (number 42), NULL_TRIGGER
  @{ */

