snech99/Cube_Solver_Robot/src/Mikrocontroller/Cube_Project/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITPWM_NULL_TRIGGER_GPIO GPIO3               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPWM_NULL_TRIGGER_GPIO_PIN 8U              /*!<@brief GPIO pin number */
#define BOARD_INITPWM_NULL_TRIGGER_GPIO_PIN_MASK (1U << 8U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPWM_NULL_TRIGGER_PORT PORT3               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPWM_NULL_TRIGGER_PIN 8U                   /*!<@brief PORT pin number */
#define BOARD_INITPWM_NULL_TRIGGER_PIN_MASK (1U << 8U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*! @name PORT3_29 (number 32), DIR_orange
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPWM_DIR_orange_GPIO GPIO3                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPWM_DIR_orange_GPIO_PIN 29U              /*!<@brief GPIO pin number */
#define BOARD_INITPWM_DIR_orange_GPIO_PIN_MASK (1U << 29U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPWM_DIR_orange_PORT PORT3                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPWM_DIR_orange_PIN 29U                   /*!<@brief PORT pin number */
#define BOARD_INITPWM_DIR_orange_PIN_MASK (1U << 29U)      /*!<@brief PORT pin mask */
                                                           /* @} */

/*! @name PORT3_31 (number 30), DIR_red
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPWM_DIR_red_GPIO GPIO3                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPWM_DIR_red_GPIO_PIN 31U              /*!<@brief GPIO pin number */
#define BOARD_INITPWM_DIR_red_GPIO_PIN_MASK (1U << 31U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPWM_DIR_red_PORT PORT3                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPWM_DIR_red_PIN 31U                   /*!<@brief PORT pin number */
#define BOARD_INITPWM_DIR_red_PIN_MASK (1U << 31U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PORT3_9 (number 41), SERVO_PWM
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPWM_SERVO_PWM_PORT PORT3               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPWM_SERVO_PWM_PIN 9U                   /*!<@brief PORT pin number */
#define BOARD_INITPWM_SERVO_PWM_PIN_MASK (1U << 9U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PORT3_6 (number 44), PWM_ALL
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPWM_PWM_ALL_PORT PORT3               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPWM_PWM_ALL_PIN 6U                   /*!<@brief PORT pin number */
#define BOARD_INITPWM_PWM_ALL_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*! @name PORT2_12 (number 22), MOTOR_EN
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPWM_MOTOR_EN_GPIO GPIO2                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPWM_MOTOR_EN_GPIO_PIN 12U              /*!<@brief GPIO pin number */
#define BOARD_INITPWM_MOTOR_EN_GPIO_PIN_MASK (1U << 12U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPWM_MOTOR_EN_PORT PORT2                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPWM_MOTOR_EN_PIN 12U                   /*!<@brief PORT pin number */
#define BOARD_INITPWM_MOTOR_EN_PIN_MASK (1U << 12U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPWM(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
